rushairer/LearnCW32/.pack/WHXY/CW32F030_DFP.1.0.5_20240617_140034/SVD/CW32F030.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="BTIM1">
      <name>BTIM2</name>
      <description>Base Timer 2</description>
      <baseAddress>0x40014900</baseAddress>
      <interrupt>
        <name>BTIM2</name>
        <description>Base Timer2 Interrupt</description>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="BTIM1">
      <name>BTIM3</name>
      <description>Base Timer 3</description>
      <baseAddress>0x40014A00</baseAddress>
      <interrupt>
        <name>BTIM3</name>
        <description>Base Timer3 Interrupt</description>
        <value>22</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>desc CRC</description>
      <baseAddress>0x40023000</baseAddress>
      <headerStructName>CRC</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE</name>
              <description>desc MODE</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR32</name>
          <description>Data register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DR32</name>
              <description>desc DR32</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR16</name>
          <description>Data register</description>
          <alternateRegister>DR32</alternateRegister>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DR16</name>
              <description>desc DR16</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR8</name>
          <description>Data register</description>
          <alternateRegister>DR32</alternateRegister>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DR8</name>
              <description>desc DR8</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT32</name>
          <description>Result register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT32</name>
              <description>desc RESULT32</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT16</name>
          <description>Result register</description>
          <alternateRegister>RESULT32</alternateRegister>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT16</name>
              <description>desc RESULT16</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>desc DMA</description>
      <baseAddress>0x40020000</baseAddress>
      <interrupt>
        <name>DMACH1</name>
        <description>DMA Channel 1 Interrupt</description>
        <value>9</value>
      </interrupt>
      <groupName>DMA</groupName>
      <headerStructName>DMA</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xB4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ISR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TE5</name>
              <description>desc TE5</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TC5</name>
              <description>desc TC5</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TE4</name>
              <description>desc TE4</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TC4</name>
              <description>desc TC4</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TE3</name>
              <description>desc TE3</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TC3</name>
              <description>desc TC3</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TE2</name>
              <description>desc TE2</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TC2</name>
              <description>desc TC2</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TE1</name>
              <description>desc TE1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TC1</name>
              <description>desc TC1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt flag clear register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TE5</name>
              <description>desc TE5</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TC5</name>
              <description>desc TC5</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TE4</name>
              <description>desc TE4</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TC4</name>
              <description>desc TC4</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TE3</name>
              <description>desc TE3</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TC3</name>
              <description>desc TC3</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TE2</name>
              <description>desc TE2</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TC2</name>
              <description>desc TC2</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TE1</name>
              <description>desc TE1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TC1</name>
              <description>desc TC1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR1</name>
          <description>Channel1 control and status register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STATUS</name>
              <description>desc STATUS</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SIZE</name>
              <description>desc SIZE</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTINC</name>
              <description>desc DSTINC</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCINC</name>
              <description>desc SRCINC</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRANS</name>
              <description>desc TRANS</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEIE</name>
              <description>desc TEIE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TCIE</name>
              <description>desc TCIE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT1</name>
          <description>Channel1 counter register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REPEAT</name>
              <description>desc REPEAT</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT</name>
              <description>desc CNT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCADDR1</name>
          <description>Channel1 source address register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRCADDR</name>
              <description>desc SRCADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSTADDR1</name>
          <description>Channel1 destination address register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DSTADDR</name>
              <description>desc DSTADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG1</name>
          <description>Channel1 trigger register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HARDSRC</name>
              <description>desc HARDSRC</description>
              <msb>7</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTSRC</name>
              <description>desc SOFTSRC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>desc TYPE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR2</name>
          <description>Channel2 control and status register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STATUS</name>
              <description>desc STATUS</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SIZE</name>
              <description>desc SIZE</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTINC</name>
              <description>desc DSTINC</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCINC</name>
              <description>desc SRCINC</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRANS</name>
              <description>desc TRANS</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEIE</name>
              <description>desc TEIE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TCIE</name>
              <description>desc TCIE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT2</name>
          <description>Channel2 counter register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REPEAT</name>
              <description>desc REPEAT</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT</name>
              <description>desc CNT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCADDR2</name>
          <description>Channel2 source address register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRCADDR</name>
              <description>desc SRCADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSTADDR2</name>
          <description>Channel2 destination address register</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DSTADDR</name>
              <description>desc DSTADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG2</name>
          <description>Channel2 trigger register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HARDSRC</name>
              <description>desc HARDSRC</description>
              <msb>7</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTSRC</name>
              <description>desc SOFTSRC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>desc TYPE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR3</name>
          <description>Channel3 control and status register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STATUS</name>
              <description>desc STATUS</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SIZE</name>
              <description>desc SIZE</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTINC</name>
              <description>desc DSTINC</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCINC</name>
              <description>desc SRCINC</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRANS</name>
              <description>desc TRANS</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEIE</name>
              <description>desc TEIE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TCIE</name>
              <description>desc TCIE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT3</name>
          <description>Channel3 counter register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REPEAT</name>
              <description>desc REPEAT</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT</name>
              <description>desc CNT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCADDR3</name>
          <description>Channel3 source address register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRCADDR</name>
              <description>desc SRCADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSTADDR3</name>
          <description>Channel3 destination address register</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DSTADDR</name>
              <description>desc DSTADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
