rushairer/LearnCW32/.pack/WHXY/CW32F030_DFP.1.0.5_20240617_140034/SVD/CW32F030.svd
        <register>
          <name>TRIG3</name>
          <description>Channel3 trigger register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HARDSRC</name>
              <description>desc HARDSRC</description>
              <msb>7</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTSRC</name>
              <description>desc SOFTSRC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>desc TYPE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR4</name>
          <description>Channel4 control and status register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STATUS</name>
              <description>desc STATUS</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SIZE</name>
              <description>desc SIZE</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTINC</name>
              <description>desc DSTINC</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCINC</name>
              <description>desc SRCINC</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRANS</name>
              <description>desc TRANS</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEIE</name>
              <description>desc TEIE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TCIE</name>
              <description>desc TCIE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT4</name>
          <description>Channel4 counter register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REPEAT</name>
              <description>desc REPEAT</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT</name>
              <description>desc CNT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCADDR4</name>
          <description>Channel4 source address register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRCADDR</name>
              <description>desc SRCADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSTADDR4</name>
          <description>Channel4 destination address register</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DSTADDR</name>
              <description>desc DSTADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG4</name>
          <description>Channel4 trigger register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HARDSRC</name>
              <description>desc HARDSRC</description>
              <msb>7</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTSRC</name>
              <description>desc SOFTSRC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>desc TYPE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR5</name>
          <description>Channel5 control and status register</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STATUS</name>
              <description>desc STATUS</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SIZE</name>
              <description>desc SIZE</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTINC</name>
              <description>desc DSTINC</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCINC</name>
              <description>desc SRCINC</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRANS</name>
              <description>desc TRANS</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEIE</name>
              <description>desc TEIE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TCIE</name>
              <description>desc TCIE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT5</name>
          <description>Channel5 counter register</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REPEAT</name>
              <description>desc REPEAT</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT</name>
              <description>desc CNT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCADDR5</name>
          <description>Channel5 source address register</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRCADDR</name>
              <description>desc SRCADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSTADDR5</name>
          <description>Channel5 destination address register</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DSTADDR</name>
              <description>desc DSTADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG5</name>
          <description>Channel5 trigger register</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HARDSRC</name>
              <description>desc HARDSRC</description>
              <msb>7</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTSRC</name>
              <description>desc SOFTSRC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>desc TYPE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
