rushairer/LearnCW32/.pack/WHXY/CW32F030_DFP.1.0.5_20240617_140034/SVD/CW32F030.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMACHANNEL1</name>
      <description>DMA Channel 1</description>
      <baseAddress>0x40020020</baseAddress>
      <alternatePeripheral>DMA</alternatePeripheral>
      <interrupt>
        <name>DMACH1</name>
        <description>DMA Channel 1 Interrupt</description>
        <value>9</value>
      </interrupt>
      <groupName>DMA</groupName>
      <headerStructName>DMACHANNEL</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <description>Channel.y control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STATUS</name>
              <description>desc STATUS</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SIZE</name>
              <description>desc SIZE</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTINC</name>
              <description>desc DSTINC</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCINC</name>
              <description>desc SRCINC</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRANS</name>
              <description>desc TRANS</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEIE</name>
              <description>desc TEIE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TCIE</name>
              <description>desc TCIE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <description>Channel.y counter register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REPEAT</name>
              <description>desc REPEAT</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT</name>
              <description>desc CNT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCADDR</name>
          <description>Channel.y source address register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRCADDR</name>
              <description>desc SRCADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSTADDR</name>
          <description>Channel.y destination address register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DSTADDR</name>
              <description>desc DSTADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG</name>
          <description>Channel.y trigger register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HARDSRC</name>
              <description>desc HARDSRC</description>
              <msb>7</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTSRC</name>
              <description>desc SOFTSRC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>desc TYPE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="DMACHANNEL1">
      <name>DMACHANNEL2</name>
      <description>DMA Channel 2</description>
      <baseAddress>0x40020040</baseAddress>
      <alternatePeripheral>DMA</alternatePeripheral>
      <interrupt>
        <name>DMACH23</name>
        <description>DMA Channel 2/3 Interrupt</description>
        <value>10</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="DMACHANNEL1">
      <name>DMACHANNEL3</name>
      <description>DMA Channel 3</description>
      <baseAddress>0x40020060</baseAddress>
      <alternatePeripheral>DMA</alternatePeripheral>
      <interrupt>
        <name>DMACH23</name>
        <description>DMA Channel 2/3 Interrupt</description>
        <value>10</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="DMACHANNEL1">
      <name>DMACHANNEL4</name>
      <description>DMA Channel 4</description>
      <baseAddress>0x40020080</baseAddress>
      <alternatePeripheral>DMA</alternatePeripheral>
      <interrupt>
        <name>DMACH45</name>
        <description>DMA Channel 2/3 Interrupt</description>
        <value>11</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="DMACHANNEL1">
      <name>DMACHANNEL5</name>
      <description>DMA Channel 5</description>
      <baseAddress>0x400200A0</baseAddress>
      <alternatePeripheral>DMA</alternatePeripheral>
      <interrupt>
        <name>DMACH45</name>
        <description>DMA Channel 2/3 Interrupt</description>
        <value>11</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>desc FLASH</description>
      <baseAddress>0x40022000</baseAddress>
      <interrupt>
        <name>FLASHRAM</name>
        <description>Flash/RAM Interrupt</description>
        <value>3</value>
      </interrupt>
      <headerStructName>FLASH</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <description>Control register1</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>desc KEY</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>SECURITY</name>
              <description>desc SECURITY</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>desc BUSY</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>STANDBY</name>
              <description>desc STANDBY</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>desc MODE</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Control register2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>desc KEY</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>CACHE</name>
              <description>desc CACHE</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FETCH</name>
              <description>desc FETCH</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT</name>
              <description>desc WAIT</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAGELOCK</name>
          <description>Page Write Erase Lock</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>desc KEY</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>LOCK15</name>
              <description>Page120 - 127</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK14</name>
              <description>Page112 - 119</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK13</name>
              <description>Page104 - 111</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK12</name>
              <description>Page96 - 103</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK11</name>
              <description>Page88 - 95</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK10</name>
              <description>Page80 - 87</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK9</name>
              <description>Page72 - 79</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK8</name>
              <description>Page64 - 71</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK7</name>
              <description>Page56 - 63</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK6</name>
              <description>Page48 - 55</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK5</name>
              <description>Page40 - 47</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK4</name>
              <description>Page32 - 39</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK3</name>
              <description>Page24 - 31</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK2</name>
              <description>Page16 - 23</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK1</name>
              <description>Page8 - 15</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK0</name>
              <description>Page0 - 7</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PROG</name>
              <description>desc PROG</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PAGELOCK</name>
              <description>desc PAGELOCK</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PC</name>
              <description>desc PC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PROG</name>
              <description>desc PROG</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PAGELOCK</name>
              <description>desc PAGELOCK</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PC</name>
              <description>desc PC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt flag clear register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PROG</name>
              <description>desc PROG</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PAGELOCK</name>
              <description>desc PAGELOCK</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PC</name>
              <description>desc PC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
