rushairer/LearnCW32/.pack/WHXY/CW32F030_DFP.1.0.5_20240617_140034/SVD/CW32F030.svd
        <register>
          <name>TOG</name>
          <description>desc TOG</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN12</name>
              <description>desc PIN12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN11</name>
              <description>desc PIN11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN10</name>
              <description>desc PIN10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN9</name>
              <description>desc PIN9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN8</name>
              <description>desc PIN8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN5</name>
              <description>desc PIN5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN4</name>
              <description>desc PIN4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN2</name>
              <description>desc PIN2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB</name>
      <description>desc GPIOB</description>
      <baseAddress>0x48000400</baseAddress>
      <interrupt>
        <name>GPIOB</name>
        <description>GPIOB Interrupt</description>
        <value>6</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GPIOC</name>
      <description>desc GPIOC</description>
      <baseAddress>0x48000800</baseAddress>
      <interrupt>
        <name>GPIOC</name>
        <description>GPIOC Interrupt</description>
        <value>7</value>
      </interrupt>
      <groupName>GPIO</groupName>
      <headerStructName>GPIOC</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x64</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIR</name>
          <description>desc DIR</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPENDRAIN</name>
          <description>desc OPENDRAIN</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPEED</name>
          <description>desc SPEED</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDR</name>
          <description>desc PDR</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUR</name>
          <description>desc PUR</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRH</name>
          <description>desc AFRH</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AFR15</name>
              <description>desc AFR15</description>
              <msb>31</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR14</name>
              <description>desc AFR14</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR13</name>
              <description>desc AFR13</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANALOG</name>
          <description>desc ANALOG</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRIVER</name>
          <description>desc DRIVER</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RISEIE</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FALLIE</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGHIE</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOWIE</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt flag clear register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>desc LOCK</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>KEY = 0x5A5A</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER</name>
          <description>desc FILTER</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLTCLK</name>
              <description>desc FLTCLK</description>
              <msb>18</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>desc IDR</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ODR</name>
          <description>desc ODR</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ODRLOWBYTE</name>
          <description>desc ODRLOWBYTE</description>
          <alternateRegister>ODR</alternateRegister>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOWBYTE</name>
              <description>desc LOWBYTE</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ODRHIGHBYTE</name>
          <description>desc ODRHIGHBYTE</description>
          <alternateRegister>ODR</alternateRegister>
          <addressOffset>0x55</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HIGHBYTE</name>
              <description>desc HIGHBYTE</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
