rushairer/LearnCW32/.pack/WHXY/CW32F030_DFP.1.0.5_20240617_140034/SVD/CW32F030.svd
        <register>
          <name>BRR</name>
          <description>desc BRR</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRR15</name>
              <description>desc BRR15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BRR14</name>
              <description>desc BRR14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BRR13</name>
              <description>desc BRR13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRR</name>
          <description>desc BSRR</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRR15</name>
              <description>desc BRR15</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BRR14</name>
              <description>desc BRR14</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BRR13</name>
              <description>desc BRR13</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BSS15</name>
              <description>desc BSS15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BSS14</name>
              <description>desc BSS14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BSS13</name>
              <description>desc BSS13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOG</name>
          <description>desc TOG</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN15</name>
              <description>desc PIN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>desc PIN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>desc PIN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOF</name>
      <description>desc GPIOF</description>
      <baseAddress>0x48001400</baseAddress>
      <interrupt>
        <name>GPIOF</name>
        <description>GPIOF Interrupt</description>
        <value>8</value>
      </interrupt>
      <groupName>GPIO</groupName>
      <headerStructName>GPIOF</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x64</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIR</name>
          <description>desc DIR</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPENDRAIN</name>
          <description>desc OPENDRAIN</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPEED</name>
          <description>desc SPEED</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDR</name>
          <description>desc PDR</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUR</name>
          <description>desc PUR</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRL</name>
          <description>desc AFRL</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AFR7</name>
              <description>desc AFR7</description>
              <msb>31</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR6</name>
              <description>desc AFR6</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR3</name>
              <description>desc AFR3</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR1</name>
              <description>desc AFR1</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR0</name>
              <description>desc AFR0</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANALOG</name>
          <description>desc ANALOG</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRIVER</name>
          <description>desc DRIVER</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RISEIE</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FALLIE</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGHIE</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOWIE</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt flag clear register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
