rushairer/LearnCW32/.pack/WHXY/CW32F030_DFP.1.0.5_20240617_140034/SVD/CW32F030.svd
        <register>
          <name>LOCK</name>
          <description>desc LOCK</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>KEY = 0x5A5A</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER</name>
          <description>desc FILTER</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLTCLK</name>
              <description>desc FLTCLK</description>
              <msb>18</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>desc IDR</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ODR</name>
          <description>desc ODR</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ODRLOWBYTE</name>
          <description>desc ODRLOWBYTE</description>
          <alternateRegister>ODR</alternateRegister>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOWBYTE</name>
              <description>desc LOWBYTE</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <description>desc BRR</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRR7</name>
              <description>desc BRR7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BRR6</name>
              <description>desc BRR6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BRR3</name>
              <description>desc BRR3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BRR1</name>
              <description>desc BRR1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BRR0</name>
              <description>desc BRR0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRR</name>
          <description>desc BSRR</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BSS7</name>
              <description>desc BSS7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BSS6</name>
              <description>desc BSS6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BSS3</name>
              <description>desc BSS3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BSS1</name>
              <description>desc BSS1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BSS0</name>
              <description>desc BSS0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOG</name>
          <description>desc TOG</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN7</name>
              <description>desc PIN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>desc PIN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>desc PIN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>desc PIN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN0</name>
              <description>desc PIN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
