rushairer/LearnCW32/.pack/WHXY/CW32F030_DFP.1.0.5_20240617_140034/SVD/CW32F030.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI1</name>
      <description>desc SPI1</description>
      <baseAddress>0x40013000</baseAddress>
      <interrupt>
        <name>SPI1</name>
        <description>SPI1 Interrupt</description>
        <value>25</value>
      </interrupt>
      <groupName>SPI</groupName>
      <headerStructName>SPI</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <description>Control register1</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MISOHD</name>
              <description>desc MISOHD</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMATX</name>
              <description>desc DMATX</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMARX</name>
              <description>desc DMARX</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>desc MODE</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WIDTH</name>
              <description>desc WIDTH</description>
              <msb>13</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSM</name>
              <description>desc SSM</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP</name>
              <description>desc SMP</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSBF</name>
              <description>desc LSBF</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BR</name>
              <description>desc BR</description>
              <msb>5</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MSTR</name>
              <description>desc MSTR</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOL</name>
              <description>desc CPOL</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CPHA</name>
              <description>desc CPHA</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODF</name>
              <description>desc MODF</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSERR</name>
              <description>desc SSERR</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OV</name>
              <description>desc OV</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UD</name>
              <description>desc UD</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSR</name>
              <description>desc SSR</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSF</name>
              <description>desc SSF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>desc RXNE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXE</name>
              <description>desc TXE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Control register2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HDOE</name>
              <description>desc HDOE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSI</name>
          <description>Slave slect register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SSI</name>
              <description>desc SSI</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SSLVL</name>
              <description>desc SSLVL</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>desc BUSY</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODF</name>
              <description>desc MODF</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSERR</name>
              <description>desc SSERR</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>OV</name>
              <description>desc OV</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>UD</name>
              <description>desc UD</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSR</name>
              <description>desc SSR</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSF</name>
              <description>desc SSF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>desc RXNE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>desc TXE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt flag clear register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODF</name>
              <description>desc MODF</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSERR</name>
              <description>desc SSERR</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OV</name>
              <description>desc OV</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UD</name>
              <description>desc UD</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSR</name>
              <description>desc SSR</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSF</name>
              <description>desc SSF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>desc RXNE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLUSH</name>
              <description>desc FLUSH</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>Data register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DR</name>
              <description>desc DR</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
