rushairer/LearnCW32/.pack/WHXY/CW32F030_DFP.1.0.5_20240617_140034/SVD/CW32F030.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <description>desc SPI2</description>
      <baseAddress>0x40003800</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 Interrupt</description>
        <value>26</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SYSCTRL</name>
      <description>System Ctrl</description>
      <baseAddress>0x40010000</baseAddress>
      <interrupt>
        <name>RCC</name>
        <description>RCC Interupt</description>
        <value>4</value>
		<name>CLKFAULT</name>
        <description>CLOCK FAULT Interrupt</description>
        <value>31</value>
      </interrupt>
      <headerStructName>SYSCTRL</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR0</name>
          <description>Control Reg0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>desc KEY</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>HCLKPRS</name>
              <description>desc HCLKPRS</description>
              <msb>7</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PCLKPRS</name>
              <description>desc PCLKPRS</description>
              <msb>4</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCLK</name>
              <description>desc SYSCLK</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>Control Reg1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>desc KEY</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>CLKCCS</name>
              <description>desc CLKCCS</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSECCS</name>
              <description>desc HSECCS</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSECCS</name>
              <description>desc LSECCS</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSELOCK</name>
              <description>desc LSELOCK</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSEEN</name>
              <description>desc LSEEN</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIEN</name>
              <description>desc LSIEN</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLEN</name>
              <description>desc PLLEN</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSEEN</name>
              <description>desc HSEEN</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIEN</name>
              <description>desc HSIEN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Control Reg2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>desc KEY</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>WAKEUPCLK</name>
              <description>desc WAKEUPCLK</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKUP</name>
              <description>desc LOCKUP</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SWDIO</name>
              <description>desc SWDIO</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interupt Enable Reg</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>desc KEY</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>HSEFAULT</name>
              <description>desc HSEFAULT</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSEFAULT</name>
              <description>desc LSEFAULT</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSEFAIL</name>
              <description>desc HSEFAIL</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSEFAIL</name>
              <description>desc LSEFAIL</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSERDY</name>
              <description>desc LSERDY</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>desc LSIRDY</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLRDY</name>
              <description>desc PLLRDY</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSERDY</name>
              <description>desc HSERDY</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIRDY</name>
              <description>desc HSIRDY</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interupt Status Reg</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LSESTABLE</name>
              <description>desc LSESTABLE</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>LSISTABLE</name>
              <description>desc LSISTABLE</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLSTABLE</name>
              <description>desc PLLSTABLE</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>HSESTABLE</name>
              <description>desc HSESTABLE</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>HSISTABLE</name>
              <description>desc HSISTABLE</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>HSEFAULT</name>
              <description>desc HSEFAULT</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>LSEFAULT</name>
              <description>desc LSEFAULT</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>HSEFAIL</name>
              <description>desc HSEFAIL</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>LSEFAIL</name>
              <description>desc LSEFAIL</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>LSERDY</name>
              <description>desc LSERDY</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>desc LSIRDY</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLRDY</name>
              <description>desc PLLRDY</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>HSERDY</name>
              <description>desc HSERDY</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIRDY</name>
              <description>desc HSIRDY</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interupt Clear Reg</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HSEFAULT</name>
              <description>desc HSEFAULT</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSEFAULT</name>
              <description>desc LSEFAULT</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSEFAIL</name>
              <description>desc HSEFAIL</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSEFAIL</name>
              <description>desc LSEFAIL</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSERDY</name>
              <description>desc LSERDY</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>desc LSIRDY</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLRDY</name>
              <description>desc PLLRDY</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSERDY</name>
              <description>desc HSERDY</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIRDY</name>
              <description>desc HSIRDY</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HSI</name>
          <description>HSI Control Reg</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STABLE</name>
              <description>desc STABLE</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIV</name>
              <description>desc DIV</description>
              <msb>14</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM</name>
              <description>desc TRIM</description>
              <msb>10</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HSE</name>
          <description>HSE Control Reg</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STABLE</name>
              <description>desc STABLE</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>DETCNT</name>
              <description>desc DETCNT</description>
              <msb>18</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT</name>
              <description>desc FLT</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>desc MODE</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WAITCYCLE</name>
              <description>desc WAITCYCLE</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQRANGE</name>
              <description>desc FREQRANGE</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVER</name>
              <description>desc DRIVER</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSI</name>
          <description>LSI Control Reg</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STABLE</name>
              <description>desc STABLE</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>WAITCYCLE</name>
              <description>desc WAITCYCLE</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM</name>
              <description>desc TRIM</description>
              <msb>9</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSE</name>
          <description>LSE Control Reg</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STABLE</name>
              <description>desc STABLE</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE</name>
              <description>desc MODE</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WAITCYCLE</name>
              <description>desc WAITCYCLE</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP</name>
              <description>desc AMP</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVER</name>
              <description>desc DRIVER</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL</name>
          <description>PLL Control Reg</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STABLE</name>
              <description>desc STABLE</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>WAITCYCLE</name>
              <description>desc WAITCYCLE</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQOUT</name>
              <description>desc FREQOUT</description>
              <msb>11</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MUL</name>
              <description>desc MUL</description>
              <msb>8</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQIN</name>
              <description>desc FREQIN</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCE</name>
              <description>desc SOURCE</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG</name>
          <description>Debug Control Reg</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WWDT</name>
              <description>desc WWDT</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IWDT</name>
              <description>desc IWDT</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC</name>
              <description>desc RTC</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AWT</name>
              <description>desc AWT</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BTIM123</name>
              <description>desc BTIM123</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM4</name>
              <description>desc GTIM4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM3</name>
              <description>desc GTIM3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM2</name>
              <description>desc GTIM2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM1</name>
              <description>desc GTIM1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIM</name>
              <description>desc ATIM</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
