rushairer/LearnCW32/.pack/WHXY/CW32F030_DFP.1.0.5_20240617_140034/SVD/CW32F030.svd
        <register>
          <name>AHBEN</name>
          <description>AHB Clock Control Reg</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOF</name>
              <description>desc GPIOF</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOC</name>
              <description>desc GPIOC</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOB</name>
              <description>desc GPIOB</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOA</name>
              <description>desc GPIOA</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC</name>
              <description>desc CRC</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH</name>
              <description>desc FLASH</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA</name>
              <description>desc DMA</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APBEN2</name>
          <description>APB Clock Control Reg2</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AWT</name>
              <description>desc AWT</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BTIM</name>
              <description>desc BTIM</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM4</name>
              <description>desc GTIM4</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM3</name>
              <description>desc GTIM3</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1</name>
              <description>desc UART1</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI1</name>
              <description>desc SPI1</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIM</name>
              <description>desc ATIM</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>VC</name>
              <description>desc VC</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC</name>
              <description>desc ADC</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APBEN1</name>
          <description>APB Clock Control Reg1</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>I2C2</name>
              <description>desc I2C2</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1</name>
              <description>desc I2C1</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART3</name>
              <description>desc UART3</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART2</name>
              <description>desc UART2</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2</name>
              <description>desc SPI2</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IWDT</name>
              <description>desc IWDT</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WWDT</name>
              <description>desc WWDT</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC</name>
              <description>desc RTC</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM2</name>
              <description>desc GTIM2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM1</name>
              <description>desc GTIM1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBRST</name>
          <description>AHB Reset Control Reg</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOF</name>
              <description>desc GPIOF</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOC</name>
              <description>desc GPIOC</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOB</name>
              <description>desc GPIOB</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOA</name>
              <description>desc GPIOA</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC</name>
              <description>desc CRC</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH</name>
              <description>desc FLASH</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA</name>
              <description>desc DMA</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRST2</name>
          <description>APB Reset Control Reg2</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AWT</name>
              <description>desc AWT</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BTIM</name>
              <description>desc BTIM</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM4</name>
              <description>desc GTIM4</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM3</name>
              <description>desc GTIM3</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1</name>
              <description>desc UART1</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI1</name>
              <description>desc SPI1</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIM</name>
              <description>desc ATIM</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>VC</name>
              <description>desc VC</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC</name>
              <description>desc ADC</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRST1</name>
          <description>APB Reset Control Reg1</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>I2C2</name>
              <description>desc I2C2</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1</name>
              <description>desc I2C1</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART3</name>
              <description>desc UART3</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART2</name>
              <description>desc UART2</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2</name>
              <description>desc SPI2</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IWDT</name>
              <description>desc IWDT</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WWDT</name>
              <description>desc WWDT</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC</name>
              <description>desc RTC</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM2</name>
              <description>desc GTIM2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM1</name>
              <description>desc GTIM1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETFLAG</name>
          <description>Reset Status Reg</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYSRESETREQ</name>
              <description>desc SYSRESETREQ</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKUP</name>
              <description>desc LOCKUP</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTB</name>
              <description>desc RSTB</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WWDT</name>
              <description>desc WWDT</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IWDT</name>
              <description>desc IWDT</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LVD</name>
              <description>desc LVD</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>POR</name>
              <description>desc POR</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTIM1CAP</name>
          <description>GTIM1 CAP Control Reg</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH4</name>
              <description>desc CH4</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <description>desc CH3</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <description>desc CH2</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <description>desc CH1</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTIM2CAP</name>
          <description>GTIM2 CAP Control Reg</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH4</name>
              <description>desc CH4</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <description>desc CH3</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <description>desc CH2</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <description>desc CH1</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTIM3CAP</name>
          <description>GTIM3 CAP Control Reg</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH4</name>
              <description>desc CH4</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <description>desc CH3</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <description>desc CH2</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <description>desc CH1</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTIM4CAP</name>
          <description>GTIM4 CAP Control Reg</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH4</name>
              <description>desc CH4</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <description>desc CH3</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <description>desc CH2</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <description>desc CH1</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ATIMETR</name>
          <description>ATIM ETR Control Reg</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ATIMETR</name>
              <description>desc ATIMETR</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTIMETR</name>
          <description>GTIM1-4 ETR Control Reg</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GTIM4ETR</name>
              <description>desc GTIM4ETR</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM3ETR</name>
              <description>desc GTIM3ETR</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM2ETR</name>
              <description>desc GTIM2ETR</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM1ETR</name>
              <description>desc GTIM1ETR</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
