rushairer/LearnCW32/.pack/WHXY/CW32F030_DFP.1.0.5_20240617_140034/SVD/CW32F030.svd
        <register>
          <name>TIMITR</name>
          <description>BTIMx GTIMx ATIM ITR Control Reg</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BTIM3ITR</name>
              <description>desc BTIM3ITR</description>
              <msb>23</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BTIM2ITR</name>
              <description>desc BTIM2ITR</description>
              <msb>20</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BTIM1ITR</name>
              <description>desc BTIM1ITR</description>
              <msb>17</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM4ITR</name>
              <description>desc GTIM4ITR</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM3ITR</name>
              <description>desc GTIM3ITR</description>
              <msb>11</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM2ITR</name>
              <description>desc GTIM2ITR</description>
              <msb>8</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM1ITR</name>
              <description>desc GTIM1ITR</description>
              <msb>5</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIMITR</name>
              <description>desc ATIMITR</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCO</name>
          <description>Master Clock Output Control Reg</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIV</name>
              <description>desc DIV</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCE</name>
              <description>desc SOURCE</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRMOD</name>
          <description>IR MOD Control Reg</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MOD</name>
              <description>desc MOD</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>UART1</name>
      <description>desc UART1</description>
      <baseAddress>0x40013800</baseAddress>
      <interrupt>
        <name>UART1</name>
        <description>UART1 Interrupt</description>
        <value>27</value>
      </interrupt>
      <groupName>UART</groupName>
      <headerStructName>UART</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x38</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <description>Control register1</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OVER</name>
              <description>desc OVER</description>
              <msb>10</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>desc START</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC</name>
              <description>desc SYNC</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>desc STOP</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PARITY</name>
              <description>desc PARITY</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RXEN</name>
              <description>desc RXEN</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEN</name>
              <description>desc TXEN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Control register2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>desc SOURCE</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMATX</name>
              <description>desc DMATX</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMARX</name>
              <description>desc DMARX</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXINV</name>
              <description>desc TXINV</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RXINV</name>
              <description>desc RXINV</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RTSEN</name>
              <description>desc RTSEN</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTSEN</name>
              <description>desc CTSEN</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGNAL</name>
              <description>desc SIGNAL</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDREN</name>
              <description>desc ADDREN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CTS</name>
              <description>CTS change</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PE</name>
              <description>Parity error</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FE</name>
              <description>Frame error</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RC</name>
              <description>Receive complete</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TC</name>
              <description>Transmit complete</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXE</name>
              <description>TxBuf empty</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BRRI</name>
          <description>desc BRRI</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRRI</name>
              <description>desc BRRI</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BRRF</name>
          <description>desc BRRF</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRRF</name>
              <description>desc BRRF</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TXBUSY</name>
              <description>desc TXBUSY</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CTSLV</name>
              <description>CTS PIN level</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CTS</name>
              <description>CTS change</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>MATCH</name>
              <description>Slave addr match</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PE</name>
              <description>Parity error</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>FE</name>
              <description>Frame error</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>RC</name>
              <description>Receive complete</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TC</name>
              <description>Transmit complete</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>TxBuf empty</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt flag clear register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CTS</name>
              <description>CTS change</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PE</name>
              <description>Parity error</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FE</name>
              <description>Frame error</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RC</name>
              <description>Receive complete</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TC</name>
              <description>Transmit complete</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDR</name>
          <description>Data reg for read</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RDR</name>
              <description>desc RDR</description>
              <msb>8</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDR</name>
          <description>Data reg for write</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TDR</name>
              <description>desc TDR</description>
              <msb>8</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR</name>
          <description>Slave addr</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>desc ADDR</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK</name>
          <description>Slave addr mask</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MASK</name>
              <description>desc MASK</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
