rushairer/LearnCW32/.pack/WHXY/CW32F030_DFP.1.0.5_20240617_140034/SVD/CW32F030.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART1">
      <name>UART2</name>
      <description>desc UART2</description>
      <baseAddress>0x40004400</baseAddress>
      <interrupt>
        <name>UART2</name>
        <description>UART2 Interrupt</description>
        <value>28</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART1">
      <name>UART3</name>
      <description>desc UART3</description>
      <baseAddress>0x40004800</baseAddress>
      <interrupt>
        <name>UART3</name>
        <description>UART3 Interrupt</description>
        <value>29</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>VC1</name>
      <description>desc VC1</description>
      <baseAddress>0x40012A00</baseAddress>
      <interrupt>
        <name>VC1</name>
        <description>Voltage Comparator 1 Interrupt</description>
        <value>14</value>
      </interrupt>
      <groupName>VC</groupName>
      <headerStructName>VC</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIV</name>
          <description>desc DIV</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VIN</name>
              <description>desc VIN</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV</name>
              <description>desc DIV</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR0</name>
          <description>Control register0</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INN</name>
              <description>desc INN</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>INP</name>
              <description>desc INP</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WINDOW</name>
              <description>desc WINDOW</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>POL</name>
              <description>desc POL</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>desc IE</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS</name>
              <description>desc HYS</description>
              <msb>4</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP</name>
              <description>desc RESP</description>
              <msb>2</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>Control register1</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BLANKFLT</name>
              <description>desc BLANKFLT</description>
              <msb>15</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANKCH3B</name>
              <description>desc BLANKCH3B</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANKCH2B</name>
              <description>desc BLANKCH2B</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANKCH1B</name>
              <description>desc BLANKCH1B</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIMBK</name>
              <description>desc ATIMBK</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIMCLR</name>
              <description>desc ATIMCLR</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIGHIE</name>
              <description>desc HIGHIE</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEIE</name>
              <description>desc RISEIE</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLIE</name>
              <description>desc FALLIE</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLTCLK</name>
              <description>desc FLTCLK</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLTTIME</name>
              <description>desc FLTTIME</description>
              <msb>3</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLTEN</name>
              <description>desc FLTEN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>READY</name>
              <description>desc READY</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLTV</name>
              <description>desc FLTV</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>INTF</name>
              <description>desc INTF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
