rushairer/LearnCW32/.pack/WHXY/CW32F030_DFP.1.0.5_20240617_140034/SVD/CW32F030.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="VC1">
      <name>VC2</name>
      <description>desc VC2</description>
      <baseAddress>0x40012A10</baseAddress>
      <interrupt>
        <name>VC2</name>
        <description>Voltage Comparator 2 Interrupt</description>
        <value>15</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>WWDT</name>
      <description>desc WWDT</description>
      <baseAddress>0x40002C00</baseAddress>
      <interrupt>
        <name>WDT</name>
        <description>Watch Dog Timer Interrupt</description>
        <value>0</value>
      </interrupt>
      <groupName>WDT</groupName>
      <headerStructName>WWDT</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR0</name>
          <description>Control register1</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WCNT</name>
              <description>desc WCNT</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>Control register2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IE</name>
              <description>desc IE</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRS</name>
              <description>desc PRS</description>
              <msb>9</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WINR</name>
              <description>desc WINR</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POV</name>
              <description>desc POV</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>